OpenEVSE/openevse_esp32_firmware/src/web_server.cpp
  String s = "{";
  if (wifi_mode_is_sta_only()) {
    s += "\"mode\":\"STA\",";
  } else if (wifi_mode_is_ap_only()) {
    s += "\"mode\":\"AP\",";
  } else if (wifi_mode_is_ap() && wifi_mode_is_sta()) {
    s += "\"mode\":\"STA+AP\",";
  }

  s += "\"wifi_client_connected\":" + String(wifi_client_connected()) + ",";
  s += "\"srssi\":" + String(WiFi.RSSI()) + ",";
  s += "\"ipaddress\":\"" + ipaddress + "\",";

  s += "\"emoncms_connected\":" + String(emoncms_connected) + ",";
  s += "\"packets_sent\":" + String(packets_sent) + ",";
  s += "\"packets_success\":" + String(packets_success) + ",";

  s += "\"mqtt_connected\":" + String(mqtt_connected()) + ",";

  s += "\"ohm_hour\":\"" + ohm_hour + "\",";

  s += "\"free_heap\":" + String(ESP.getFreeHeap()) + ",";

  s += "\"comm_sent\":" + String(comm_sent) + ",";
  s += "\"comm_success\":" + String(comm_success) + ",";

  s += "\"amp\":" + String(amp) + ",";
  s += "\"pilot\":" + String(pilot) + ",";
  s += "\"temp1\":" + String(temp1) + ",";
  s += "\"temp2\":" + String(temp2) + ",";
  s += "\"temp3\":" + String(temp3) + ",";
  s += "\"state\":" + String(state) + ",";
  s += "\"elapsed\":" + String(elapsed) + ",";
  s += "\"wattsec\":" + String(wattsec) + ",";
  s += "\"watthour\":" + String(watthour_total) + ",";

  s += "\"gfcicount\":" + String(gfci_count) + ",";
  s += "\"nogndcount\":" + String(nognd_count) + ",";
  s += "\"stuckcount\":" + String(stuck_count) + ",";

  s += "\"divertmode\":" + String(divertmode) + ",";
  s += "\"solar\":" + String(solar) + ",";
  s += "\"grid_ie\":" + String(grid_ie) + ",";
  s += "\"charge_rate\":" + String(charge_rate) + ",";
  s += "\"divert_update\":" + String((millis() - lastUpdate) / 1000);

#ifdef ENABLE_LEGACY_API
  s += ",\"networks\":[" + st + "]";
  s += ",\"rssi\":[" + rssi + "]";
  s += ",\"version\":\"" + currentfirmware + "\"";
  s += ",\"ssid\":\"" + esid + "\"";
  //s += ",\"pass\":\""+epass+"\""; security risk: DONT RETURN PASSWORDS
  s += ",\"emoncms_server\":\"" + emoncms_server + "\"";
  s += ",\"emoncms_node\":\"" + emoncms_node + "\"";
  //s += ",\"emoncms_apikey\":\""+emoncms_apikey+"\""; security risk: DONT RETURN APIKEY
  s += ",\"emoncms_fingerprint\":\"" + emoncms_fingerprint + "\"";
  s += ",\"mqtt_server\":\"" + mqtt_server + "\"";
  s += ",\"mqtt_topic\":\"" + mqtt_topic + "\"";
  s += ",\"mqtt_user\":\"" + mqtt_user + "\"";
  //s += ",\"mqtt_pass\":\""+mqtt_pass+"\""; security risk: DONT RETURN PASSWORDS
  s += ",\"www_username\":\"" + www_username + "\"";
  //s += ",\"www_password\":\""+www_password+"\""; security risk: DONT RETURN PASSWORDS
  s += ",\"ohmkey\":\"" + ohm + "\"";
#endif
  s += "}";

  DBUGVAR(lastUpdate);
  DBUGVAR(millis());
  DBUGVAR((millis() - lastUpdate) / 1000);

  response->setCode(200);
  response->print(s);
  request->send(response);
}

// -------------------------------------------------------------------
// Returns OpenEVSE Config json
// url: /config
// -------------------------------------------------------------------
void
handleConfig(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response)) {
    return;
  }

  String dummyPassword = String(DUMMY_PASSWORD);

  String s = "{";
  s += "\"firmware\":\"" + firmware + "\",";
  s += "\"protocol\":\"" + protocol + "\",";
  s += "\"espflash\":" + String(ESP.getFlashChipSize()) + ",";
  s += "\"version\":\"" + currentfirmware + "\",";
  s += "\"diodet\":" + String(diode_ck) + ",";
  s += "\"gfcit\":" + String(gfci_test) + ",";
  s += "\"groundt\":" + String(ground_ck) + ",";
  s += "\"relayt\":" + String(stuck_relay) + ",";
  s += "\"ventt\":" + String(vent_ck) + ",";
  s += "\"tempt\":" + String(temp_ck) + ",";
  s += "\"service\":" + String(service) + ",";
#ifdef ENABLE_LEGACY_API
  s += "\"l1min\":\"" + current_l1min + "\",";
  s += "\"l1max\":\"" + current_l1max + "\",";
  s += "\"l2min\":\"" + current_l2min + "\",";
  s += "\"l2max\":\"" + current_l2max + "\",";
  s += "\"kwhlimit\":\"" + kwh_limit + "\",";
  s += "\"timelimit\":\"" + time_limit + "\",";
  s += "\"gfcicount\":" + String(gfci_count) + ",";
  s += "\"nogndcount\":" + String(nognd_count) + ",";
  s += "\"stuckcount\":" + String(stuck_count) + ",";
#endif
  s += "\"scale\":" + String(current_scale) + ",";
  s += "\"offset\":" + String(current_offset) + ",";
  s += "\"ssid\":\"" + esid + "\",";
  s += "\"pass\":\"";
  if(epass != 0) {
    s += dummyPassword;
  }
  s += "\",";
  s += "\"emoncms_enabled\":" + String(config_emoncms_enabled() ? "true" : "false") + ",";
  s += "\"emoncms_server\":\"" + emoncms_server + "\",";
  s += "\"emoncms_node\":\"" + emoncms_node + "\",";
  s += "\"emoncms_apikey\":\"";
  if(emoncms_apikey != 0) {
    s += dummyPassword;
  }
  s += "\",";
  s += "\"emoncms_fingerprint\":\"" + emoncms_fingerprint + "\",";
  s += "\"mqtt_enabled\":" + String(config_mqtt_enabled() ? "true" : "false") + ",";
  s += "\"mqtt_server\":\"" + mqtt_server + "\",";
  s += "\"mqtt_topic\":\"" + mqtt_topic + "\",";
  s += "\"mqtt_user\":\"" + mqtt_user + "\",";
  s += "\"mqtt_pass\":\"";
  if(mqtt_pass != 0) {
    s += dummyPassword;
  }
  s += "\",";
  s += "\"mqtt_solar\":\""+mqtt_solar+"\",";
  s += "\"mqtt_grid_ie\":\""+mqtt_grid_ie+"\",";
  s += "\"www_username\":\"" + www_username + "\",";
  s += "\"www_password\":\"";
  if(www_password != 0) {
    s += dummyPassword;
  }
  s += "\",";
  s += "\"ohm_enabled\":" + String(config_ohm_enabled() ? "true" : "false");
  s += "}";

  response->setCode(200);
  response->print(s);
  request->send(response);
}

#ifdef ENABLE_LEGACY_API
// -------------------------------------------------------------------
// Returns Updates JSON
// url: /rapiupdate
// -------------------------------------------------------------------
void
handleUpdate(MongooseHttpServerRequest *request) {

  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response)) {
    return;
  }

  String s = "{";
  s += "\"comm_sent\":" + String(comm_sent) + ",";
  s += "\"comm_success\":" + String(comm_success) + ",";
  s += "\"ohmhour\":\"" + ohm_hour + "\",";
  s += "\"espfree\":\"" + String(espfree) + "\",";
  s += "\"packets_sent\":\"" + String(packets_sent) + "\",";
  s += "\"packets_success\":\"" + String(packets_success) + "\",";
  s += "\"amp\":" + amp + ",";
  s += "\"pilot\":" + pilot + ",";
  s += "\"temp1\":" + temp1 + ",";
  s += "\"temp2\":" + temp2 + ",";
  s += "\"temp3\":" + temp3 + ",";
  s += "\"state\":" + String(state) + ",";
  s += "\"elapsed\":" + String(elapsed) + ",";
  s += "\"estate\":\"" + estate + "\",";
  s += "\"wattsec\":" + wattsec + ",";
  s += "\"watthour\":" + watthour_total;
  s += "}";

  response->setCode(200);
  response->print(s);
  request->send(response);
}
#endif

// -------------------------------------------------------------------
// Reset config and reboot
// url: /reset
// -------------------------------------------------------------------
void
handleRst(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
    return;
  }

  config_reset();
#ifndef ESP32
  ESP.eraseConfig();
#endif // !ESP32

  response->setCode(200);
  response->print("1");
  request->send(response);

  systemRebootTime = millis() + 1000;
}


// -------------------------------------------------------------------
// Restart (Reboot)
// url: /restart
// -------------------------------------------------------------------
void
handleRestart(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
    return;
  }

  response->setCode(200);
  response->print("1");
  request->send(response);

  systemRestartTime = millis() + 1000;
}


// -------------------------------------------------------------------
// Emoncms describe end point,
// Allows local device discover using https://github.com/emoncms/find
// url: //emoncms/describe
// -------------------------------------------------------------------
void handleDescribe(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseBasic *response = request->beginResponse();
  response->setCode(200);
  response->setContentType(CONTENT_TYPE_TEXT);
  response->addHeader("Access-Control-Allow-Origin", "*");
  response->setContent("openevse");
  request->send(response);
}

// -------------------------------------------------------------------
// Update firmware
// url: /update
// -------------------------------------------------------------------
void
handleUpdateGet(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_HTML)) {
    return;
  }

  response->setCode(200);
  response->print(
    F("<html><form method='POST' action='/update' enctype='multipart/form-data'>"
        "<input type='file' name='firmware'> "
        "<input type='submit' value='Update'>"
      "</form></html>"));
  request->send(response);
}

void
handleUpdatePost(MongooseHttpServerRequest *request) {
  #ifndef ESP32
  bool shouldReboot = !Update.hasError();
  MongooseHttpServerResponse *response = request->beginResponse(200, CONTENT_TYPE_TEXT, shouldReboot ? "OK" : "FAIL");
  response->addHeader("Connection", "close");
  request->send(response);

  if(shouldReboot) {
    systemRestartTime = millis() + 1000;
  }

  #else // ! ESP32

  request->send(500, CONTENT_TYPE_TEXT, "Not supported");

  #endif // !ESP32
}

extern "C" uint32_t _SPIFFS_start;
extern "C" uint32_t _SPIFFS_end;
//static int lastPercent = -1;

void
handleUpdateUpload(MongooseHttpServerRequest *request, String filename, size_t index, uint8_t *data, size_t len, bool final)
{
#ifndef ESP32
  if(!index)
  {
    dumpRequest(request);

    DBUGF("Update Start: %s", filename.c_str());

